{
  "id": "c657923", "name": "The Flash",
  "universe": "u137070",
  "pic": "https://upload.wikimedia.org/wikipedia/en/thumb/2/22/Flash_Pack.jpg/250px-Flash_Pack.jpg",
  "short_desc": "Nicknamed the \"Scarlet Speedster\", all incarnations of the Flash possess \"super speed\", which includes the ability to run and move extremely fast, use superhuman reflexes, and seemingly violate certain laws of physics.",
  "full_desc": "All incarnations of the Flash can move, think, and react at light speeds as well as having superhuman endurance that allows them to run incredible distances. Some, notably later versions, can vibrate so fast that they can pass through walls in a process called quantum tunneling, travel through time and can also lend and borrow speed. Furthermore, all members have an invisible aura around their bodies that prevents themselves and their clothes from being affected by air friction as they move at high speed. Speedsters can heal more rapidly than the average human.\n\nOn several occasions, the Flash has raced against Superman, either to determine who is faster or as part of a mutual effort to thwart some type of threat; these races, however, often resulted in ties because of outside circumstances. Writer Jim Shooter and artist Curt Swan crafted the story \"Superman's Race With the Flash!\" in Superman #199 (Aug. 1967) which featured the first race between the Flash and Superman. Writer E. Nelson Bridwell and artist Ross Andru produced \"The Race to the End of the Universe\", a follow-up story four months later in The Flash #175 (Dec. 1967). However, after the DC Universe revision after Crisis on Infinite Earths, The Flash does successfully beat Superman in a race in Adventures of Superman #463 with the explanation that Superman is not accustomed to running at high speed for extended periods of time since flying is more versatile and less strenuous, which means the far more practiced Flash has the advantage. After Final Crisis in Flash: Rebirth #3 the Flash is shown as being significantly faster than Superman, able to outrun him as Superman struggles to keep up with him. He reveals that all the close races between them before had been \"for charity\". In the Smallville episode \"Run\", Flash is not only able to run faster than a pre-Superman Clark Kent but can match Clark's top speed while running backwards.\n\nWhile various incarnations of the Flash have proven their ability to run at light speed, the ability to steal speed from other objects allows respective Flashes to even significantly surpass this velocity. In Flash: The Human Race Wally is shown absorbing kinetic energy to an extent enabling him to move faster than teleportation and run from the end of the universe back to earth in less than a Planck instant (Planck time).\n\nSpeedsters may at times use the ability to speed-read at incredible rates and in doing so, process vast amounts of information. Whatever knowledge they acquire in this manner is usually temporary (Bart Allen seems to be the exception, though in earlier years, Max Mercury believed that Bart's speed learning would not stick). Their ability to think fast also allows them some immunity to telepathy, as their thoughts operate at a rate too rapid for telepaths such as Martian Manhunter or Gorilla Grodd to read or influence their minds.\n\nFlashes and other super-speedsters also have the ability to speak to one another at a highly accelerated rate. This is often done to have private conversations in front of non-fast people (as when Flash speaks to Superman about his ability to serve both the Titans and the JLA in The Titans #2). Speed-talking is also sometimes used for comedic effect where Flash becomes so excited that he begins talking faster and faster until his words become a jumble of noise. He also has the ability to change the vibration of his vocal cords making it so he can change how his voice sounds to others.\n\nWhile not having the physical strength of his comrades and enemies, Flash has shown to be able to use his speed to exert incredible momentum into physical attacks. In Injustice: Gods Among Us, Flash uses these kinds of attacks as many of his special moves.\n\nThe Flash has also claimed that he can process thoughts in less than an attosecond. At times he is able to throw lightning created by his super speed and make speed vortexes.\n\nSome flashes also have the ability to create speed avatars(i.e. duplicates) and these avatars have sometimes been sent to different timelines to complete a particular mission.(Barry Allen exhibits this ability in the live action series \"The Flash\").\n\nHe can also be seen negating the effects of the anti-life equation, when he freed Iris-West from its control (probably due to his connection with the speed force).",
  "allies": [],
  "enemies": [],
  "tags": ["SuperPowers", "MainCharacter"]
}
